; domain
; Domain file for the Problem 1 of APTP Assignment

(define (domain assignment1)

    (:requirements :strips :typing)

    (:types
        robot ; robotic agent
        person
        crate
        location
        content ; content of creates: food, medicine, ...
    )

    (:predicates
        (robot_at ?r - robot ?l - location)     ;robot r is at location l
        (person_at ?p - person ?l - location)   ;person p is at location l
        (crate_at ?c - crate ?l - location)     ;crate c is at location l
        (contain ?c - crate ?co - content)      ;crate c has content co (TODO: assume contains only one content)
        (available ?c - crate)                  ;crate c has not been delivered yet
        (need ?p - person ?co - content)        ;person p needs content co (TODO: no need content already had)
        (have ?p - person ?co - content)        ;person p has content co (TODO: can need co even if it has co?)
        (hold ?r - robot ?c - crate)            ;robot r holds crate c
        (empty ?r - robot)                      ;robot r is empty
    )

    ; robot r picks up the crate c at location l
    (:action pick_up
        :parameters (?r - robot ?c - crate ?l - location)
        :precondition (and (robot_at ?r ?l) (crate_at ?c ?l) (empty ?r) (available ?c))
        :effect (and (hold ?r ?c) (not (empty ?r)) (not (crate_at ?c ?l)))
    )
    
    ; robot r moves from location l1 to location l2
    (:action move
        :parameters (?r - robot ?l1 ?l2 - location)
        :precondition (and (robot_at ?r ?l1))
        :effect (and (robot_at ?r ?l2) (not (robot_at ?r ?l1)))
    )

    ; robot r delivers crate c with content co to person p at location l
    (:action deliver
        :parameters (?r - robot ?c - crate ?p - person ?l - location ?co - content)
        :precondition (and (robot_at ?r ?l) (person_at ?p ?l) 
                        (hold ?r ?c) (contain ?c ?co) (need ?p ?co))
        :effect (and (not (need ?p ?co)) (have ?p ?co) (crate_at ?c ?l)
                    (not (hold ?r ?c)) (empty ?r) (not (available ?c)))
    )   

)

; problem
; Problem file for the Problem 1 of APTP Assignment

(define (problem problem1a) (:domain assignment1)
    (:objects 
        robot1 - robot
        p1 p2 p3 p4 - person
        c1 c2 c3 c4 c5 - crate
        depot l1 l2 l3 - location
        medicine food beverage - content
    )

    ; a single robotic agent is located at the depot
    ; all crates are located at the depot
    (:init
        (robot_at robot1 depot) 
        (person_at p1 l1) (person_at p2 l2) (person_at p3 l3) (person_at p4 l3)
        (crate_at c1 depot) (crate_at c2 depot) (crate_at c3 depot) (crate_at c4 depot) (crate_at c5 depot)
        (contain c1 medicine) (contain c2 food) (contain c3 beverage) (contain c4 medicine) (contain c5 food)
        (available c1) (available c2) (available c3) (available c4) (available c5)
        (need p1 food) (need p1 beverage)
        (need p3 medicine)
        (need p4 food)
        (have p1 medicine) (have p2 food) (have p3 beverage)
        (empty robot1)
    )

    ; people have crates containing what they need
    (:goal (and
        (have p1 food) (have p1 beverage)
        (have p3 medicine)
        (have p4 food)
    ))

    (:metric minimize (cost))

)

; plan
1. (pick_up robot1 c1 depot)
   deleted: (empty robot1) (crate_at c1 depot)
   added: (hold robot1 c1)
   goals met: 0 of 4
2. (move robot1 depot l3)
   deleted: (robot_at robot1 depot)
   added: (robot_at robot1 l3)
   goals met: 0 of 4
3. (deliver robot1 c1 p3 l3 medicine)
   deleted: (need p3 medicine) (hold robot1 c1) (available c1)
   added: (have p3 medicine) (crate_at c1 l3) (empty robot1)
   goals met: 1 of 4
4. (move robot1 l3 depot)
   deleted: (robot_at robot1 l3)
   added: (robot_at robot1 depot)
   goals met: 1 of 4
5. (pick_up robot1 c3 depot)
   deleted: (empty robot1) (crate_at c3 depot)
   added: (hold robot1 c3)
   goals met: 1 of 4
6. (move robot1 depot l1)
   deleted: (robot_at robot1 depot)
   added: (robot_at robot1 l1)
   goals met: 1 of 4
7. (deliver robot1 c3 p1 l1 beverage)
   deleted: (need p1 beverage) (hold robot1 c3) (available c3)
   added: (have p1 beverage) (crate_at c3 l1) (empty robot1)
   goals met: 2 of 4
8. (move robot1 l1 depot)
   deleted: (robot_at robot1 l1)
   added: (robot_at robot1 depot)
   goals met: 2 of 4
9. (pick_up robot1 c2 depot)
   deleted: (empty robot1) (crate_at c2 depot)
   added: (hold robot1 c2)
   goals met: 2 of 4
10. (move robot1 depot l1)
   deleted: (robot_at robot1 depot)
   added: (robot_at robot1 l1)
   goals met: 2 of 4
11. (deliver robot1 c2 p1 l1 food)
   deleted: (need p1 food) (hold robot1 c2) (available c2)
   added: (have p1 food) (crate_at c2 l1) (empty robot1)
   goals met: 3 of 4
12. (move robot1 l1 depot)
   deleted: (robot_at robot1 l1)
   added: (robot_at robot1 depot)
   goals met: 3 of 4
13. (pick_up robot1 c5 depot)
   deleted: (empty robot1) (crate_at c5 depot)
   added: (hold robot1 c5)
   goals met: 3 of 4
14. (move robot1 depot l3)
   deleted: (robot_at robot1 depot)
   added: (robot_at robot1 l3)
   goals met: 3 of 4
15. (deliver robot1 c5 p4 l3 food)
   deleted: (need p4 food) (hold robot1 c5) (available c5)
   added: (have p4 food) (crate_at c5 l3) (empty robot1)
   goals met: 4 of 4
